app/controllers/posts_controller.rb

	def update
		@post = Post.find_by(id: params[:id])
		@post.update(title: params[:title], description: params[:description])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "asdfasdfasdfsafasf"], ["description", "asdfsadfsasdfgsdfgs"], ["updated_at", "2018-07-21 19:32:33.535424"], ["id", 8]]

	def destroy
		Post.find_by(id: params[:id]).delete
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 6]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 6]]