app/controllers/posts_controller.rb

	def edit
	  @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE (2) LIMIT 1